// 1. 동기와 비동기 처리에 대하여 설명하라.
// 동기  : 코드가 위에서 아래로 내려오면서 하나가 끝나야 다음 코드가 실행되는 방식
// 비동기 : 위의 코드가 연산이 끝나지 않아도 다음 코드를 실행하는 방식

// 2. 싱글 스레드와 멀티 스레드에 대하여 설명하라.

// 3. 쿠키와 세션, 로컬저장소의 차이점에 대하여 설명하라.
// 쿠키는 클라우드에 저장 및 보안취약
// 세션은 서버 자원을 사용하며 암호화 가능, 쿠키에 비해 보안에 강함
// 로컬 저장소 == 그냥 내 컴퓨터...

// 4. 콜백지옥이 무엇이고 이것을 해결하기 위한 방안은 무엇인지 설명하라.

// 5. Node.js 이벤트 큐 동작원리에 대하여 설명하라.

// 6. GET, POST 방식에 대하여 설명하라.
// GET : url에서 쳐서 바로 접근이 가능한 방식
// POST : url에서 직접적으로 접근이 불가능하고 data를 담아 전달하는 방식

// 7. 자바스크립트의 배열이 실제 자료구조 배열이 아닌데 그 이유는 무엇인가?
// 일반적인 배열을 흉내낸 객체....가짜 배열..

// 8. http와 https의 차이점은 무엇인가?
// 암호화의 차이

// 9. 브라우저 렌더링 과정에 대하여 설명하라.

// 10. 호이스팅이 무엇인지 서술하라.
// JavaScript는 함수의 코드를 실행하기 전에 함수 선언에 대한 메모리부터 할당한다.
// 그렇기에 함수를 호출하는 코드를 함수 선언보다 앞서 배치할 수 있다.
// 함수랑 변수는 상단부에 선언해야 scope의 꼬임 현상을 막을 수 있다.
